manohar486/EMBEDDED_CPP_STM32/led/Src/complete_driver.cpp
#include "stm32f405xx.h"
#include <stdint.h>

// USART3_TX → PC10
// USART3_RX → PC11

uint8_t read_Ch;

void USART3_init(void);
void USART3_write(uint8_t ch);
uint8_t USART3_read(void);
void delayMs(int);
void USART3_string(const char *str);


/*----------------------------------------------------------
  MAIN
----------------------------------------------------------*/
int main(void)
{
    USART3_init();   // Initialize UART

   while (1)
    {
        USART3_write('A');// 1 byte
        uint8_t ch=USART3_read();

        USART3_write(ch);
        delayMs(500);
        USART3_string("SAI RAKESH ADI\n");

   }
}

/*----------------------------------------------------------
  USART3 Initialization
----------------------------------------------------------*/
void USART3_init(void)
{
    RCC->AHB1ENR |= (1 << 2);   // Enable GPIOC clock
    RCC->APB1ENR |= (1 << 18);  // Enable USART3 clock

    // PC10 → TX
    GPIOC->MODER &= ~(3 << 20); // pin10 =pin*2, claered the bits
    GPIOC->MODER |=  (1 << 21);   // Alternate function -10
    // created Array :AFR[2]  , AFR[0]=AFRL ,AFR[1]= AFRH
    GPIOC->AFR[1] &= ~(0xF << 8); // AFRH =AFR[1]- Clearing 4 bits
    GPIOC->AFR[1] |=  (7 << 8);   // AF7 (USART3) // 0111 for AF7

    // PC11 → RX
    GPIOC->MODER &= ~(3 << 22);
    GPIOC->MODER |=  (1 << 23);// 10 AFR mode
    GPIOC->AFR[1] &= ~(0xF << 12);// AFRH Register
    GPIOC->AFR[1] |=  (7 << 12); // AF7 -0111

    // USART settings
    USART3->BRR = 0x008B;      // 9600 baud @ 16 MHz(HSI)
    USART3->CR1 |= (1 << 3);   // TE
    //USART3->CR1 |= (1 << 2);   // RE
    USART3->CR1 |= (1 << 13);  // UE - USART enable
}

/*----------------------------------------------------------
  Write one byte
----------------------------------------------------------*/
void USART3_write(uint8_t ch) //ch ='A'
{
    // Wait until DR empty
    while (!(USART3->SR & (1 << 7))); // TXE =0 while(!0) - while loop(true)
    //TXE=1 Data in DR register will be given to shift register

    USART3->DR = ch; // new data will be loaded to DR

    // Wait until transmission complete
    while (!(USART3->SR & (1 << 6))); // TC=0 while(!0) while(T) waiting
}

///*----------------------------------------------------------
//  Read one byte (blocking)
//----------------------------------------------------------*/
uint8_t USART3_read(void)
{
    while (!(USART3->SR & (1 << 5))); // RXNE
    return USART3->DR;
}

/*----------------------------------------------------------
  Delay
----------------------------------------------------------*/
void delayMs(int n)
{
    for (; n > 0; n--)
        for (volatile int i = 0; i < 2000; i++);
}

void USART3_string(const char *str)
{

	while(*str)
	{
		USART3_write(*str);
		str++;
	}
}
